Repository: MuhammadAli01222000/Programming_Questions
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Error
uz: Xatolik yuz berdi

source: Question
uz: Savol

source: Quiz
uz: Viktorina

# selectLanguage
source: Select a programming language
uz: Dasturlash tilini tanlang

# selectLevel
source: Select your level
uz: Darajangizni tanlang

# infoDart
source: Dart is a modern and fast programming language used for Flutter development.
uz: Dart — Flutter uchun zamonaviy va tezkor dasturlash tili hisoblanadi.

# infoJava
source: Java is one of the most widely used programming languages in the world.
uz: Java — dunyodagi eng ko‘p qo‘llaniladigan dasturlash tillaridan biridir.

# infoJavaScript
source: JavaScript is an interactive programming language used for the web.
uz: JavaScript — veb uchun interaktiv dasturlash tili hisoblanadi.

# infoPython
source: Python is widely used in data analysis, artificial intelligence, and robotics.
uz: Python — ma'lumotlar tahlili, sun'iy intellekt, robototexnika kabi sohalarda keng qo‘llaniladi.

# resultPage
source: View Results
uz: Natijalarni ko'rish

source: Correct
uz: To‘g‘ri

# wrong
source: Incorrect
uz: Noto‘g‘ri

# result
source: Your result
uz: Sizning natijangiz

# info
source: Read more
uz: Batafsil o‘qish uchun

# withAi
source: Questions generated with AI
uz: Sun'iy inteletk orqali savollar
